用户交互

可维护性和可重用性一般，采用DHTML技术，提供一系列脚本库，可伸缩性较好，考虑项目的可扩充性和可持续性。
用户页面组织
	在展示设计和交互设计之间的权衡中，衡量出屏幕大小和结点原子性哪个具有更高的优先级，结点是否可以拆分成几个更小的结点，是否可以用更多的导航来代替滚动。
	对于网上微博来说，我们采用结点一部分HTML页面发送给用户的方式，因为微博的实时性，所以对信息的数量要求是比较高的，页面会显示有意义的部分信息，其余的用户感兴趣的信息页面由用户自己导航获取，由于微博的可移植性要求比较高，该方案可移植性好，但是导航语义和重用性较差。页面加链接的方式避免了滚屏，但是增加了导航以及更多的延时。
导航设计
	导航过程通过锚的文本在用户界面中触发，导航整体的组织在于方便显示用户随手想了解到的东西，支持有意义的导航活动。页面中使用一致的导航类型，使用文字图形的混合方式链接。
控件控制
	第三方服务器的控件具有广泛的兼容性和安全性，分栏目的主题名称使用用户容易理解的名称，以用户第一人称的角度命名方式，减少生硬的称谓给用户带来的不友好感觉。
表单控制
	表单内任务无关的信息、较少使用的选项等通过DHTML技术和服务端的隐藏来减少用户操作中的干扰因素，在特定的字段域附近给出必填信息提示，验证的错误要给出准确的指导，为提高用户的效率，使用客户端验证，表单中用户在交互过程中保证用户方便地切换编辑、浏览状态，方便用户以最快的速度获取需要的信息，提高操作效率。
窗体控制
	使用具有广泛兼容性的Javascript控制客户端交互和简单导航，操作过程中保证各显示窗体的数据同步，弹出窗体的页面主题、栏目标题等资料相关联的父窗体保持上下文一致，方便用户理解做出处理策略。
输入设计和提示信息
	微博采用能自动纠正的输入方式，对于错别字提供可修改政策，重视回复的信息并对一些敏感词做出提示并和谐，对于一些删除了的微博和回复，可以做出查看和彻底销毁，而回复被删除也会对用户给出提示，认证用户的提示代表着这个号的右边会有一个标识，此人则是经过一系列认证的，具有保护效益的人，不是假冒冒充的，此外，微博用户可以给自己所发的微博和收藏的微博打标签（或分类）
出错处理及出错页面的跳转
	在用户状态过期，或者用户无法进行操作时，系统会自动跳转至登录界面，在系统内部问题或者页面维护时，给出相应的提示，而在用户操作发生错误代码时，可以给用户明显的提示，以引导用户快速地恢复工作状态，系统提供程序级的错误截获，方便维护和管理，协助用户处理复杂的交互任务。
  
  
展示设计：

    登陆页面的左上角是我们微博的LOGO，右边是快速登陆 注册框。
主页左部为实时信息，可以不停切换显示多个信息。
![alt next](http://ww1.sinaimg.cn/mw690/4aa33e58tw1e5emgo0mk9j20dw07st8w)
登陆界面
我们微博的个人主页页面背景色是可以随意更改的，可以在登陆后在设置中进行修改，系统会保存设置内容并在以后登陆中使用这些设置信息。
最顶端是工具栏，包括应用、管理、设置、工具、退出等选项。
左上角是微博的LOGO。
与LOGO同行 右边是搜索框。
页面正上方是自己的个人简介及近期动态。
左边是个人的照片。
右边是自己微博的统计相关信息，包括关注、粉丝等。
下方是微博的具体内容，微博按照发布时间排序显示，微博用户名和用户头像显示在正文之前，微博正文下面显示添加的图片或视频，视频和图片以地址链接存储。右下角显示翻页按钮，点击下一页页面切换到下一页的微博内容，点击上一页页面切换到上一页的微博内容。如果该页已经是第一页，则上一页按钮为灰色不能点击和响应，如果该页已经是最后一页，则下一页按钮为灰色不能点击和相应。
每条微博下方都有评论界面。
照片下方是个人信息选项，包括个人信息、关注、粉丝、分组、相册等选项。
微博信息下方是本人的粉丝列表和个人标签。
![alt next](http://ww1.sinaimg.cn/mw690/4aa33e58tw1e5emqekbiwj20eu0i2js2)


内容设计：
微博发布：
微博内容输入框，左下角有添加表情、图片、视频、圈好友等按钮，完成相应功能。右下角有发布按钮。
微博内容输入框：一个空白文字输入框，限定可以输入140个字。输入到框的右边界自动换行。
表情按钮：点击表情按钮调用数据库，显示自带表情，点击相应表情可直接插入微博的文字中。
图片按钮：点击图片按钮，弹出对话框“添加本地图片”，点击此按钮，可以选择添加一张本地图片，该图片将显示在微博文字下方。
视频按钮：操作方式及链接均和添加图片相同。
圈好友按钮：点击圈好友按钮，会弹出对话框显示出已经关注的人，点击相应的人，@该人将显示在微博正文中，且该人将收到消息提示。

微博分组：
微博分组由用户自己定义，用户将关注的人分在不同的组中，点击不同的组名，就会显示出改分组下的人所发布的微博，不同的组的信息存储在数据库中属于不同的组下，点击不同的组名即会调用数据库下不同组的数据显示出来。

微博显示：
微博按照发布时间排序显示，微博用户名和用户头像显示在正文之前，微博正文下面显示添加的图片或视频，视频和图片以地址链接存储。
右下角显示翻页按钮，点击下一页页面切换到下一页的微博内容，点击上一页页面切换到上一页的微博内容。如果该页已经是第一页，则上一页按钮为灰色不能点击和响应，如果该页已经是最后一页，则下一页按钮为灰色不能点击和相应。
